INSERT INTO [dbo].[Products] ([НАЗВАНИЕ], [ТИП], [КАЛОРИЙНОСТЬ], [БЕЛКИ], [ЖИРЫ], [УГЛЕВОДЫ], [СПИРТ]) VALUES 
(N'Бренди', N'Алкоголь',255,  0,0,1,40),
(N'Вермут', N'Алкоголь', 155, 0 ,0 , 15.9, 15 );
INSERT INTO [dbo].[Products] ([НАЗВАНИЕ], [ТИП], [КАЛОРИЙНОСТЬ], [БЕЛКИ], [ЖИРЫ], [УГЛЕВОДЫ], [СПИРТ]) VALUES 
(N'Вино сухое', N'Алкоголь', 66,0, 0, 0, 12 ),
 (N'Вино полусухое',N'Алкоголь',78 ,0.3 ,0 ,2.5, 14 ),
(N'Вино десертное',N'Алкоголь', 175,0.5 ,0 ,20 ,12),
(N'Вино полусладкое',N'Алкоголь',88 ,0.2 ,0 ,5 , 13),
(N'Вино столовое',N'Алкоголь',67 ,0.2 ,0 ,0.2,15),
(N'Виски',N'Алкоголь',222 ,0 ,0 ,0, 40 ), 
(N'Водка',N'Алкоголь',234 ,0 ,0 ,0.1,40),
(N'Джин',N'Алкоголь', 223 ,0 ,0 ,0, 38 ),
(N'Коньяк',N'Алкоголь', 240,0, 0, 0.1 , 36),
 (N'Ликер',N'Алкоголь',344 ,0 ,0 ,53 ,22 ),
 (N'Пиво 3%',N'Алкоголь',37 ,0.6 ,0 ,3.5 , 0.3 ),
  (N'Пиво 4.5%',N'Алкоголь',45 ,0.8 ,0 ,4.5 ,4.5  ),
   (N'Пиво тёмное',N'Алкоголь',39 ,0.2 ,0 ,4 ,5.8 ),
 (N'Портвейн',N'Алкоголь',167 ,0 ,0 ,13.8 , 15 ),
  (N'Шампанское',N'Алкоголь',88 ,0.3 ,0 ,5.2 ,8  );

INSERT INTO PRODUCTS(НАЗВАНИЕ, ТИП, КАЛОРИЙНОСТЬ, БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ, СПИРТ)
VALUES 
(N'Абрикосовый сок',N'Безалкогольные напитки',39 ,0.9 ,0.2 ,9.2 ,0 ),
(N'Ананасовый сок',N'Безалкогольные напитки',48 ,0.2 ,0.2 , 11.4, 0),
(N'Апельсиновый сок',N'Безалкогольные напитки',36 ,0.9,0.1 ,8.4 ,0 ),
(N'Виноградный сок',N'Безалкогольные напитки', 56 ,0.3 ,0 ,14.5 ,0 ),
(N'Вишнёвый сок',N'Безалкогольные напитки',49 ,0.5 ,0 ,10.6 ,0 ),
(N'Гранатовый сок',N'Безалкогольные напитки', 58,0.2 ,0 ,14 ,0 ),
(N'Какао на молоке',N'Безалкогольные напитки', 377, 24,17 ,33.1 ,0 ),
(N'Квас хлебный',N'Безалкогольные напитки',26 , 0.2,0 ,5 , 0.3),
(N'Кола',N'Безалкогольные напитки', 40, 0, 0, 10, 0),
(N'Кофе с молоком',N'Безалкогольные напитки', 56, 0.8,1 ,11 ,0 ),
(N'Лимонад',N'Безалкогольные напитки',24 ,0 ,0 ,6.1 ,0 ),
(N'Лимонный сок',N'Безалкогольные напитки', 18,1 ,0.1 ,3.2 ,0 ),
(N'Морковный сок',N'Безалкогольные напитки',31 ,1 ,0.1 , 6.5,0 ),
(N'Персиковый сок',N'Безалкогольные напитки',37 ,0.8 ,0.1 ,9.1 ,0 ),
(N'Пиво безалкогольное',N'Безалкогольные напитки', 22,0 ,0 ,4.1 ,0 ),
(N'Зелёный чай', N'Безалкогольные напитки',0 ,0 ,0 ,0 ,0 ),
(N'Чай чёрный без сахара', N'Безалкогольные напитки',0 ,0 ,0 ,0 ,0 ),
(N'Чёрный чай с лимоном и сахаром(2 ч.л.)', N'Безалкогольные напитки',41 ,0.8 ,0.7 ,8.3 ,0 ),
(N'Чёрный чай со сгущенным молоком(2 ч.л)', N'Безалкогольные напитки',112 ,2.4 ,2.9 ,19.1 ,0 ),
(N'Энергетический напиток', N'Безалкогольные напитки', 47,0 ,0 ,11.4 ,0 ),
(N'Яблочный сок', N'Безалкогольные напитки', 42,0.5 ,0.4 ,9.7 ,0 );

INSERT INTO PRODUCTS(НАЗВАНИЕ, ТИП,  БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ, КАЛОРИЙНОСТЬ, СПИРТ)
VALUES 
(N'Колбаса вареная',N'Колбасные изделия', 13.4,22.9 ,0 ,283 ,0 ),
(N'Колбаса полукопчёная',N'Колбасные изделия',18.2 ,43.5 ,0 ,415 ,0 ),
(N'Колбаса сырокопчёная',N'Колбасные изделия', 23.7,45 ,0 ,486 ,0 ),
(N'Сервелат',N'Колбасные изделия', 24.1,40.2 ,0 ,453 ,0 ),
(N'Колбаски охотничьи',N'Колбасные изделия', 27.1,24.6 ,0 ,325 ,0 ),
(N'Салями',N'Колбасные изделия', 21.3,53.6 ,1.1 ,576 ,0 );

INSERT INTO PRODUCTS (НАЗВАНИЕ, ТИП,  БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ, КАЛОРИЙНОСТЬ)
VALUES 
(N'Яйцо куриное', N'Яйца', 9.7, 15.5, 1.7, 181),
(N'Яйцо перепелиное', N'Яйца',11.9 ,13.3 ,0.8 ,170 ),
(N'Яйцо страусиное', N'Яйца',12.4 ,11.5 ,0.8 ,118 ),
(N'Яйцо утиное', N'Яйца',13.5 ,14.1 ,0.2 ,176 ),
(N'Яичный порошок', N'Яйца',45.3 ,37.3 ,5.1 ,545 );

insert into products (НАЗВАНИЕ,ТИП, КАЛОРИЙНОСТЬ,	БЕЛКИ,	ЖИРЫ,	УГЛЕВОДЫ) 
values 
(N'Йогурт 1.5%',N'Молочные продукты', 65,	4.3, 1.5,8.4),
(N'Йогурт 3.2%',N'Молочные продукты',	87,	5,	3.2,	8.9),
(N'Кефир 2,5%',N'Молочные продукты',	51,	3,	2.5,	4),
(N'Молоко коровье',N'Молочные продукты',	58,	2.8,	3.2,	4.6),
(N'Молоко обезжиренное',N'Молочные продукты',	30,	2.1,	0.1,	4.5),
(N'Молоко сухое цельное',N'Молочные продукты',	477,	25.2,	25,	39.6),
(N'Молоко сгущенное',N'Молочные продукты',139,	7.3,	7.7,	9.7),
(N'Ряженка',N'Молочные продукты',	68,	2.9,	4,	4),
(N'Сливки 20%',N'Молочные продукты',	209,	2.8,	20,	3.9);
insert into products (НАЗВАНИЕ,ТИП, КАЛОРИЙНОСТЬ,	БЕЛКИ,	ЖИРЫ,	УГЛЕВОДЫ) 
values 
(N'Сметана',N'Молочные продукты',208,	3,	20,	2.9),
(N'Сырки из творожной массы',N'Молочные продукты',	344,	7.3,	23,	27.6),
(N'Сыр голландский',N'Молочные продукты',	352,	26.4,26.5,	0),
(N'Сыр пошехонский',N'Молочные продукты',348,26.4,26.3,0),
(N'Сыр российский',N'Молочные продукты',	366,	24.1,	29.8,	0.4),
(N'Сыр сулугуни',N'Молочные продукты',293,20,24.2,0),
(N'Творог', N'Молочные продукты',186,16.5,9,1.9);

insert into Products (НАЗВАНИЕ, ТИП, КАЛОРИЙНОСТЬ, БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ)
VALUES 
(N'Баранина', N'Мясо,птица',201 ,16.2 ,15.3 ,0 ),
(N'Говядина', N'Мясо,птица', 191,18.7 ,12.6 ,0 ),
(N' Конина', N'Мясо,птица',149,20.33 ,7.1 ,0 ),
(N'Кролик', N'Мясо,птица', 197,20.60 ,12.8 ,0 ),
(N'Свинина нежирная ', N'Мясо,птица', 318 ,16.3 ,27.9 ,0 ),
(N'Свинина жирная ', N'Мясо,птица', 484,11.6 ,49.1 ,0 ),
(N'Телятина ', N'Мясо,птица', 91, 19.9,1.1 ,0 ),
(N'Индейка', N'Мясо,птица', 192,21.1 ,12.3 ,0.6 ),
(N'Курица', N'Мясо,птица',161 ,20.4 ,8.6 ,0.6 );

insert into Products (НАЗВАНИЕ, ТИП , КАЛОРИЙНОСТЬ, БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ)
VALUES 
(N'Горбуша',N'Рыба',	151,	21.2,	7.1,	0),
(N'Кальмар',N'Рыба',	77,	18.2,	0.2,	0),
(N'Карп',N'Рыба',	95,	16,	3.5,	0),
(N'Крабовые палочки',N'Рыба',	73,	17.9,	2.1,	0),
(N'Креветка',N'Рыба',85,18,	0.9	,0),
(N'Лосось',N'Рыба',200,19.2,13.8,0),
(N'Мидии отварные',N'Рыба',53,9.7,1.6	,0),
(N'Салака'	,N'Рыба',124,17.1,5.8	,0),
(N'Сельдь',N'Рыба',	248,	17.3,	19.9,	0),
(N'Скумбрия',N'Рыба',	158,18,9.5,0),
(N'Тунец',N'Рыба',	95,	21.7,	1.3,	0),
(N'Устрицы',N'Рыба',	91,	14.4,	0.3,	6.2),
(N'Форель',N'Рыба',	99,	19.6,	2.1,	0);


				
insert into Products (НАЗВАНИЕ, ТИП , КАЛОРИЙНОСТЬ, БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ)
VALUES 								
(N'Варенье',N'Сладости',	286,	0.4,	0.2,	74.5),
(N'Вафли',N'Сладости',425,8.2,19.8,53.1),
(N'Гематоген',N'Сладости',352,6.2,2.8,75.5),
(N'Драже фруктовое',N'Сладости',	388,	3.7,	10.3,	73.4),
(N'Зефир',N'Сладости',195,0.7,0,77.3),
(N'Карамель',N'Сладости',291,0,0.2,77.3),
(N'Конфеты шоколадные',N'Сладости',576,3.9,39.7,54.6),
(N'Мармелад',N'Сладости',	289,	0,	0.2,	77.1),
(N'Мед',N'Сладости',312	,0.6	,0	,80.5),
(N'Мороженое пломбир',N'Сладости',223,3.6,15.1,20.5),
(N'Пастила',N'Сладости',	301,	0.6,	0,	80.1),
(N'Печенье овсяное',N'Сладости',430	,6.5	,14.1,71.4),
(N'Печенье сдобное',N'Сладости',447,10.5,5.2,	76),
(N'Сахар',N'Сладости',377,0.2,0,99.6),
(N'Халва подсолнечная',N'Сладости',	519,	11.4,	29.3,	54.6),
(N'Шоколад темный',N'Сладости',546,	5.2,35.6,52.4),
(N'Шоколад молочный',N'Сладости',552,	6.7,	35.6,	52.4);
				

insert into Products (НАЗВАНИЕ, ТИП , КАЛОРИЙНОСТЬ, БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ)
values
(N'Абрикосы',N'Фрукты и ягоды',	44,0.7,	0,	10.1),
(N'Ананас',N'Фрукты и ягоды',49,	0.3,	0,	11.9),
(N'Апельсин',N'Фрукты и ягоды',	38,	0.8,	0,	8.6),
(N'Бананы',N'Фрукты и ягоды',	87,	1.7,	0,	22.1),
(N'Брусника',N'Фрукты и ягоды',42,0.6,	0,	8.8),
(N'Виноград',N'Фрукты и ягоды',	73,	0.5,	0,	17.8),
(N'Вишня',N'Фрукты и ягоды',	46,0.9,0,11.1),
(N'Гранат',	N'Фрукты и ягоды',53,	0.9,	0,	11.9),
(N'Грейпфрут',N'Фрукты и ягоды',37,0.8,0,7.5),
(N'Груша',N'Фрукты и ягоды', 41,	0.5,	0,	10.6),
(N'Голубика',N'Фрукты и ягоды',35,	1.1,	0,	7.4),
(N'Дыня',N'Фрукты и ягоды',	34,	0.8,	0.3,	7.3),
(N'Ежевика',N'Фрукты и ягоды',31,1.9,0,5.1),
(N'Земляника',N'Фрукты и ягоды',	40,	1.9,	0,	7.1),
(N'Инжир',N'Фрукты и ягоды',57,0.9,0,13.7),
(N'Киви',N'Фрукты и ягоды',46,	1,	0.7,	9.7),
(N'Клубника',N'Фрукты и ягоды',30,0.6,0.4,7),
(N'Клюква',N'Фрукты и ягоды',	27,	0.7,	0,	4.9),
(N'Крыжовник',N'Фрукты и ягоды',43,0.8,0,	9.7),
(N'Лимон',N'Фрукты и ягоды',	30,	0.9,	0,	3.3),
(N'Малина',N'Фрукты и ягоды',	43,	0.7,	0,	9.2),
(N'Мандарин',N'Фрукты и ягоды',39,0.9,0,8.8),
(N'Манго',N'Фрукты и ягоды', 69,0.6,0.4,11.8),
(N'Персики',N'Фрукты и ягоды',42,	0.9,	0,	10.1),
(N'Памело',N'Фрукты и ягоды',29,0.6,0.1,6.1),
(N'Слива',N'Фрукты и ягоды',	41,	0.8,	0,	9.7),
(N'Смородина красная',N'Фрукты и ягоды',39,0.6,0,8.7),
(N'Смородина черная',N'Фрукты и ягоды',	38,	1,	0,	8),
(N'Хурма',N'Фрукты и ягоды',61,0.7,0,15.7),
(N'Черешня',N'Фрукты и ягоды',	54,	1.3,	0,	12.5),
(N'Черника',N'Фрукты и ягоды',41,1.2,0,8.8),

(N'Шиповник свежий',N'Фрукты и ягоды',106,1.5,0,24.2),
(N'Шиповник сушеный',N'Фрукты и ягоды',	259,	4.5,	0,	60.1),
(N'Яблоки',N'Фрукты и ягоды',	48,0.5	,0,11.4);
				
insert into Products (НАЗВАНИЕ, ТИП , КАЛОРИЙНОСТЬ, БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ)	
values 
(N'Батон',N'Хлебобулочные изделия, мука',	261,	9.4,	2.7,	50.7),
(N'Булочка',N'Хлебобулочные изделия, мука',	318,	7.4,	1.8,	43.7),
(N'Лаваш армянский',N'Хлебобулочные изделия, мука',	239,	7.7,	1.1,	47.8),
(N'Мука пшеничная высшего сорта',N'Хлебобулочные изделия, мука',	324,	10.4,	0.8,	74.5),
(N'Мука пшеничная I сорта',N'Хлебобулочные изделия, мука',	329,	10.6,	1.4,	73.6),
(N'Мука пшеничная II сорта',N'Хлебобулочные изделия, мука',	328,	11.6,	1.9,	70.7),
(N'Мука ржаная',N'Хлебобулочные изделия, мука',	321,	6.8,	1.2,76.8),
(N'Хлеб ржаной',N'Хлебобулочные изделия, мука',	210,	4.7,	0.6,	49.5),
(N'Хлеб пшеничный из муки I сорта',N'Хлебобулочные изделия, мука',	246,	7.4,	2.2,	53);


